Core/src/src/Documents/ДокументЗапроса/ДокументЗапроса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДокументЗапроса</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.РегистрДокументЗапроса</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СостоянияДокументЗапроса</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказшик</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДепартаментИспольнитель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретРедактированияДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пометка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПередатьВЗаказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>9</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/Documents/ДокументЗапроса/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ДатаДоставкиПриИзменении(Элемент)
	// Вставить содержимое обработчика.	
	Если Объект.Запасы.Количество() > 0 Тогда 
		
		Для Каждого стр Из Объект.Запасы Цикл 
			
			стр.ДатаДоставки = Объект.ДатаДоставки;
			
		КонецЦикла;
		
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	// Вставить содержимое обработчика.
	
	Если ЗначениеЗаполнено(Объект.ДатаДоставки) Тогда 
		
		ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ДатаДоставки = Объект.ДатаДоставки;		
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(Объект.Проект) Тогда 
		
		ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Проект = Объект.Проект;		
	КонецЕсли;
	
	ЕдИзи = ПолучитьЕдИзм(ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Номенклатура);			
	ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ЕдиницаИзмерения = ЕдИзи;
	//ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ПередатьВЗаказ = Истина;
КонецПроцедуры


Функция ПолучитьЕдИзм(Номенклатура)
	
	
	Возврат Номенклатура.ЕдиницаИзмерения;	
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект,;
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь(); 	
	//--------------------------------------------------------------------------
	// © Шишка В.В. [25 июня 2023]  НАЧАЛО
	//Объект.Статус = Справочники.СостоянияДокументЗапроса.ВРаботе;
	// © Шишка В.В. [25 июня 2023]  КОНЕЦ
	//--------------------------------------------------------------------------
	//Объект.СтруктурнаяЕдиница = ТекущийПользователь;
	
	
КонецПроцедуры


&НаКлиенте 
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	Если Объект.Запасы.Количество() > 0 Тогда 
		
		Для Каждого стр Из Объект.Запасы Цикл 
			
			стр.Проект = Объект.Проект;
			
		КонецЦикла;
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВиделитьВсе(Команда)
	
	//Если Не Объект.Пометка Тогда    
	//	Для Каждого Строка Из Объект.Запасы Цикл
	//		Строка.ПередатьВЗаказ = Истина;
	//		Объект.Пометка = Истина;  
	//	КонецЦикла;
	//Иначе
	//	Для Каждого Строка Из Объект.Запасы Цикл
	//		Строка.ПередатьВЗаказ = Ложь;
	//		Объект.Пометка = Ложь;			
	//	КонецЦикла;
	//	
	//КонецЕсли;
	
	Для Каждого Строка ИЗ Объект.Запасы Цикл
		Строка.ПередатьВЗаказ = (НЕ Объект.Пометка);
	КонецЦикла;
	
	Объект.Пометка = (НЕ Объект.Пометка);
	Записать();
КонецПроцедуры
